#Introduction
Welcome to the final project by Michael (Shuangyu) Han, Mars (Runzhi) Gu, and Steven Walxim

In this project, we will attempt to predict global temperature change based on the population, GDP, carbon emission, and deforestation of different geographical locations

We will achieve this goal by extracting data from difference reliable sources, cleaning, visualizing, and modeling the data

#Cleaning

In [ ]:
!pip install googledrivedownloader

Requirement already satisfied: googledrivedownloader in /usr/local/lib/python3.7/dist-packages (0.4)

Import Data Files from Google Drive

In [ ]:
#global temperature
!gdown 1a7NAbGr7aTxvUaB0pZIM58lpxOpim0OQ --id
#by City
!gdown 1CFr_HZd_dQjvxSQR1buElJrW8ZUJrXF2 --id
#by Major City
!gdown 1JhZwWcdOI4D4Ta-cDw26p5hhQ6uEWFP2 --id
#by State
!gdown 1ExxCrfEhLIgh8tTkswcoQKRrNjGdT-Mo --id
#by Country
!gdown 1rPogwew95J2oL6kYetdEZeNbSFzmQEev --id

Downloading...
From: https://drive.google.com/uc?id=1a7NAbGr7aTxvUaB0pZIM58lpxOpim0OQ
To: /content/GlobalTemperatures.csv
100% 206k/206k [00:00<00:00, 62.4MB/s]
Downloading...
From: https://drive.google.com/uc?id=1CFr_HZd_dQjvxSQR1buElJrW8ZUJrXF2
To: /content/GlobalLandTemperaturesByCity.csv
100% 533M/533M [00:03<00:00, 176MB/s]
Downloading...
From: https://drive.google.com/uc?id=1JhZwWcdOI4D4Ta-cDw26p5hhQ6uEWFP2
To: /content/GlobalLandTemperaturesByMajorCity.csv
100% 14.1M/14.1M [00:00<00:00, 124MB/s]
Downloading...
From: https://drive.google.com/uc?id=1ExxCrfEhLIgh8tTkswcoQKRrNjGdT-Mo
To: /content/GlobalLandTemperaturesByState.csv
100% 30.8M/30.8M [00:00<00:00, 116MB/s]
Downloading...
From: https://drive.google.com/uc?id=1rPogwew95J2oL6kYetdEZeNbSFzmQEev
To: /content/GlobalLandTemperaturesByCountry.csv
100% 22.7M/22.7M [00:00<00:00, 182MB/s]

In [ ]:
#GDP
!gdown 1q3xv60tw0Vb3E_KlqAcVV_ef_g7ZonE7 --id
#Population
!gdown 1mcOZ4o3F0Mt44NOMMSNyhnu6isdd0kgk --id
#Deforestation
!gdown 1QHSh5V34l9khRJixJ2jjLZzJnc_bj_IW --id
#Carbon Emission
!gdown 1prQnwFxAAq27m9HxiLZdaQLFeQyGo_qI --id

Downloading...
From: https://drive.google.com/uc?id=1q3xv60tw0Vb3E_KlqAcVV_ef_g7ZonE7
To: /content/GDP.csv
100% 262k/262k [00:00<00:00, 76.4MB/s]
Downloading...
From: https://drive.google.com/uc?id=1mcOZ4o3F0Mt44NOMMSNyhnu6isdd0kgk
To: /content/Population.csv
100% 182k/182k [00:00<00:00, 67.8MB/s]
Downloading...
From: https://drive.google.com/uc?id=1QHSh5V34l9khRJixJ2jjLZzJnc_bj_IW
To: /content/Deforestation.csv
100% 12.3k/12.3k [00:00<00:00, 20.5MB/s]
Downloading...
From: https://drive.google.com/uc?id=1prQnwFxAAq27m9HxiLZdaQLFeQyGo_qI
To: /content/CO2.csv
100% 5.17M/5.17M [00:00<00:00, 80.3MB/s]

Import Tools to Use in Project

In [ ]:
import pandas as pd

Importing Global Temperature CSV Files into Pandas

In [ ]:
global_temp = pd.read_csv('/content/GlobalTemperatures.csv')
global_temp_state = pd.read_csv('/content/GlobalLandTemperaturesByState.csv')
global_temp_Mcity = pd.read_csv('/content/GlobalLandTemperaturesByMajorCity.csv')
global_temp_country = pd.read_csv('/content/GlobalLandTemperaturesByCountry.csv')
global_temp_city = pd.read_csv('/content/GlobalLandTemperaturesByCity.csv')

In [ ]:
gdp = pd.read_csv('/content/GDP.csv', skiprows=4)
population = pd.read_csv('/content/Population.csv', skiprows=4)
deforest = pd.read_csv('/content/Deforestation.csv')
co2 = pd.read_csv('/content/CO2.csv')

In [ ]:
data = global_temp_country

In [ ]:
global_temp_country.describe()

       AverageTemperature  AverageTemperatureUncertainty
count       544811.000000                  545550.000000
mean            17.193354                       1.019057
std             10.953966                       1.201930
min            -37.658000                       0.052000
25%             10.025000                       0.323000
50%             20.901000                       0.571000
75%             25.814000                       1.206000
max             38.842000                      15.003000

In [ ]:
global_temp_country

        year  AverageTemperature  ...   Country       month
0       1743               4.384  ...     Åland  1743-11-01
1       1743                 NaN  ...     Åland  1743-12-01
2       1744                 NaN  ...     Åland  1744-01-01
3       1744                 NaN  ...     Åland  1744-02-01
4       1744                 NaN  ...     Åland  1744-03-01
...      ...                 ...  ...       ...         ...
577457  2013              19.059  ...  Zimbabwe  2013-05-01
577458  2013              17.613  ...  Zimbabwe  2013-06-01
577459  2013              17.000  ...  Zimbabwe  2013-07-01
577460  2013              19.759  ...  Zimbabwe  2013-08-01
577461  2013                 NaN  ...  Zimbabwe  2013-09-01

[577462 rows x 5 columns]

In [ ]:
data['month'] = data['dt']
data.dt = data.dt.apply(lambda x: x[0:4])

In [ ]:
data.columns = ['year', 'AverageTemperature', 'AverageTemperatureUncertainty', 'Country', 'month']

In [ ]:
data

        year  AverageTemperature  ...   Country       month
0       1743               4.384  ...     Åland  1743-11-01
1       1743                 NaN  ...     Åland  1743-12-01
2       1744                 NaN  ...     Åland  1744-01-01
3       1744                 NaN  ...     Åland  1744-02-01
4       1744                 NaN  ...     Åland  1744-03-01
...      ...                 ...  ...       ...         ...
577457  2013              19.059  ...  Zimbabwe  2013-05-01
577458  2013              17.613  ...  Zimbabwe  2013-06-01
577459  2013              17.000  ...  Zimbabwe  2013-07-01
577460  2013              19.759  ...  Zimbabwe  2013-08-01
577461  2013                 NaN  ...  Zimbabwe  2013-09-01

[577462 rows x 5 columns]

In [ ]:
data.dropna(axis=0, inplace=True)

In [ ]:
data.groupby(data.year).AverageTemperature.mean()

year
1743     5.184140
1744     9.837898
1745     1.387125
1750     9.129353
1751     9.167388
          ...
2009    19.546385
2010    19.629806
2011    19.456040
2012    19.468744
2013    19.877007
Name: AverageTemperature, Length: 267, dtype: float64

In [ ]:
data.year['1747']

0         1743
5         1744
6         1744
7         1744
8         1744
          ...
577456    2013
577457    2013
577458    2013
577459    2013
577460    2013
Name: year, Length: 544811, dtype: object

In [ ]:
temp_country_globalavg_df = data

In [ ]:
temp_country_globalavg_df.groupby(by="year").AverageTemperature.mean().reset_index()

     year  AverageTemperature
0    1743            5.184140
1    1744            9.837898
2    1745            1.387125
3    1750            9.129353
4    1751            9.167388
..    ...                 ...
262  2009           19.546385
263  2010           19.629806
264  2011           19.456040
265  2012           19.468744
266  2013           19.877007

[267 rows x 2 columns]